""" Урок 9, завдання 1, модуль для взаємодіі з користувачем
Перепишіть домашнє завдання попереднього уроку (сервіс для скорочення посилань) таким чином, щоб
у нього була основна частина, яка відповідала би за логіку роботи та надавала узагальнений інтерфейс, і
модуль представлення, який відповідав би за взаємодію з користувачем. При заміні останнього на
інший, який взаємодіє з користувачем в інший спосіб, програма має продовжувати коректно працювати.
"""

from faker import Faker
from random import choice

fake = Faker()


def set_short_url() -> str:
    return fake.url()


def set_url(url: str) -> str:
    return url + fake.uri_path()


def get_url(short_url_list: list) -> str:
    return choice(short_url_list)
